unit DataUnit;

interface

{---------- Settings ----------------------------------------------------------}
type TSettings=record
  MethodCalc:integer;//Метод розрахунку (макс-мін, імовірнісний, авто вибір)
  Kompens1:boolean;  //Використання взаємокомпенсації у розрах.
  Addings:boolean;   // Додаткові функції
  Demo:boolean;      //Для демонстрації
  Date1:boolean;     //Друк дати в звіті
  Time1:boolean;     //Друк дати і часу в звіті
  Wview:boolean;     //Друк рівнянь відхилень у звіті
  SaveMet:integer;   //Метод збереження звіту (0-.txt, 1-.doc [MS Word])
end;
{---------- Settings ----------------------------------------------------------}

{----------тип - інформація про обробку поверхонь------------------------------}
type TCut=record
  Ob:integer;       //Кількість обробок
  Oper1:integer;    //Операція, на якій виконана 1-ша обробка
  Oper2:integer;    //Операція, на якій виконана 2-га обробка
  Oper3:integer;    //Операція, на якій виконана 3-тя обробка
  Oper4:integer;    //Операція, на якій виконана 4-та обробка
  Oper5:integer;    //Операція, на якій виконана 5-та обробка
  Oper6:integer;    //Операція, на якій виконана 6-та обробка
  Oper7:integer;    //Операція, на якій виконана 7-ма обробка
  Oper8:integer;    //Операція, на якій виконана 8-ма обробка
  Axis:boolean;     //Чи є поверхня віссю (так, ні)
end;
{----------тип - інформація про обробку поверхонь------------------------------}

{----------тип - Конструкторські розміри---------------------------------------}
type TAi=record
 NAi:integer;       //Номер розміру
 N1List:integer;    //Номер лівої опорної поверхні в списку
 N1:string;         //Номер лівої опорної поверхні (*.9)
 N1f:string;        //Номер лівої опорної поверхні (*.*f)
 N2List:integer;    //Номер правої опорної поверхні в списку
 N2:string;         //Номер правої опорної поверхні (*.9)
 N2f:string;        //Номер правої опорної поверхні (*.*f)
 Size:real;         //номінальний розмір
 IT:string;         //Квалітет
 ES:real;           //верхнє відхилення
 EI:real;           //нижнє відхилення
 T:real;            //допуск
 Em:real;           //середина поля допуску
 Amax:real;         //максимальний розмір
 Amin:real;         //мінімальний розмір
 Am:real;           //середній розмір
 Amf:real;          //фактичний середній розмір
 Kind:integer;      //Тип розміру (вал, отвір, інший)
 W:real;            //Поле розсіювання
 Psi:real;          //коефіцієнт надійності ТП
end;
{----------тип - Конструкторські розміри---------------------------------------}

{----------тип - Розміри заготовки---------------------------------------------}
type TBi=record
 NBi:integer;       //Номер розміру
 N1List:integer;    //Номер лівої опорної поверхні в списку
 N1:string;         //Номер лівої опорної поверхні
 N2List:integer;    //Номер правої опорної поверхні в списку
 N2:string;         //Номер правої опорної поверхні
 Size:real;         //номінальний розмір
 ES:real;           //верхнє відхилення
 EI:real;           //нижнє відхилення
 T:real;            //допуск
 Em:real;           //середина поля допуску
 Bmax:real;         //максимальний розмір
 Bmin:real;         //мінімальний розмір
 Bm:real;           //середній розмір
 Zagot:integer;      //Спосіб отримання заготовки
 W:real;            //Поле розсіювання
end;
{----------тип - Розміри заготовки---------------------------------------------}

{----------тип - Технологічні розміри------------------------------------------}
type TFi=record
 NFi:integer;       //Номер розміру
 N1List:integer;    //Номер лівої опорної поверхні в списку
 N1:string;         //Номер лівої опорної поверхні
 N2List:integer;    //Номер правої опорної поверхні в списку
 N2:string;         //Номер правої опорної поверхні
 Size:real;         //номінальний розмір
 ES:real;           //верхнє відхилення
 EI:real;           //нижнє відхилення
 T:real;            //допуск
 Em:real;           //середина поля допуску
 Fmax:real;         //максимальний розмір
 Fmin:real;         //мінімальний розмір
 Fm:real;           //середній розмір
 W:real;            //Поле розсіювання
 Wek:real;          //середня статистична точність обробки
 Eb:real;           //похибка базування
 Rvb:real;          //просторове відхилення вимірювальної бази
 dRvb:real;         //розрах відхилення вимірювальної бази
 Koef:real;         //коеф-нт, який враховує спосіб установки (1>=k>=2)
 Kind:integer;      //Вид розміру (вал, отвір, інший)
 Typ1:integer;      //Тип розміру
 IT:integer;        //Точність розміру
 Oper:integer;      //Номер операції
 AvtoEb:integer;    //Автоматичний розрахунок похибки базування
end;
{----------тип - Технологічні розміри------------------------------------------}

{----------тип - Припуски------------------------------------------------------}
type TZi=record
 NZi:integer;       //Номер припуску
 Name:string;       //Позначення припуску
 N1:string;         //Номер лівої опорної поверхні
 N2:string;         //Номер правої опорної поверхні
 Met:integer;       //Спосіб задання припуску
 Zmax:real;         //максимальний розмір
 Zmin:real;         //мінімальний розмір
 Zm:real;           //середній розмір
 Kind:integer;      //Тип припуску (прямий, зворотний)
 W:real;            //Поле розсіювання
end;
{----------тип - Припуски------------------------------------------------------}

{----------тип - технологічні бази---------------------------------------------}
type Ttb=record
 NOper:integer;     //Номер операції
 NameOper:string;   //Ім'я операції
 pOX:integer;       //Позиція в списку для 0X
 OX:string;         //ТБ по 0Х
 pOY:integer;       //Позиція в списку для 0Y
 OY:string;         //ТБ по 0Y
end;
{----------тип - технологічні бази---------------------------------------------}

{----------тип - Матриця розмірних зв'язків------------------------------------}
type TMatrix=record
 Names:char;           //імена ланок (B,F)
 index:integer;        //порядкові номери ланок
end;
{----------тип - Матриця розмірних зв'язків------------------------------------}

{----------тип - операційні розмірні ланцюги-----------------------------------}
type TORL=record
 Lp1:char;             //ліва частина ОРЛ вид розміру (констр., припуск)
 Lp2:integer;          //ліва частина ОРЛ порядковий номер розміру
 Rp0:array of char;    //знак розм. (+, -)
 Rp1:array of char;    //права частина ОРЛ вид розміру (технол., загот.)
 Rp2:array of integer; //права частина ОРЛ порядковий номер розміру
 Kompens:array of integer;//наявність компенсації похибок на величину і-го розм.
 chain1:string;
 chain2:string;
 chain3:string;
end;
{----------тип - операційні розмірні ланцюги-----------------------------------}

{-------------временный ОРЛ с индексами направления поиска---------------------}
Type TTempORL=record
 LpC    : Char;             // левая часть буква
 LpN    : Integer;          // левая часть знак
 Rp0    : array of char;    // правая знак (от движения)
 Rp1    : array of char;    // правая вид размера (тех заг)
 Rp2    : array of Integer; // правая порядковый номер
 Rp3    : array of Char;    // маркер направвления движения
 Mb     : Boolean;          // маркер отката на один шаг
 LpCDir : array of String;  // маркер провереных направлений начала ОРЛ
 RpCDir : array of String;  // маркер проверенных направлений замыкающего размера ОРЛ
 FVer   : array of Integer; // вертикаль координаты найденного елемента
 FHor   : array of Integer; // горизонталь координаты найденного елемента
end;
{-------------временный ОРЛ с индексами направления помиска--------------------}

var
Name, fname, Mname : string;
  forma,            //форма деталі
  Mtype,            //серійність виробництва
  NOp,              //К-сть операцій ТП
  NZag,             //К-сть поверхонь заготовки
  NDet,             //К-сть поверхонь деталі
  NBi,              //К-сть розмірів заготовки
  NAi,              //К-сть конструкторських розмірів
  NFi,              //К-сть технологічних розмірів
  Zn:integer;
  NPov: integer;
  PAi: array of TAi;               //Масив властивостей конструкторських розм.
  PBi: array of TBi;               //Масив властивостей розм. заготовки
  PFi: array of TFi;               //Масив властивостей технологічних розм.
  PZi: array of TZi;               //Масив властивостей припусків
  adres: String; //для адреса, откуда запущена программа
implementation
uses
  MainUnit, SettingsUnit, Unit_NewCalc, UnitPovParametrs, UnitAiSet, UnitZiSet,
  UnitResults;



END.
